/* Задача 29: Напишите программу, которая задаёт массив из N элементов (из диапазона [0-14] ) и выводит на экран десятичное представление числа, записанного в СС по основанию 15
   N: 3 [9, 4, 12] => 2097 */
Console.WriteLine("Задача 29.");
Task_seminar_4.Task_29();
/* Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
 452 -> 11
 82 -> 10
 9012 -> 12
 Строки использовать нельззя */
Console.WriteLine("Задача 27.");
Task_seminar_4.Task_27();
/* Задача 25: Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.
   3, 5 -> 243 (3⁵)
   2, 4 -> 16
   НЕЛЬЗЯ ИСПОЛЬЗОВАТЬ Math.Pow */
Console.WriteLine("Задача 25.");
Task_seminar_4.Task_25();